==========================================
L2 troubleshooting commands
==========================================
show net interface all-properties
show net interface all-properties raw
show net interface 1.1 all-properties raw
show net trunk
show net vlan
list net vlan all
show net arp all
==========================================
"sys
  ip-address
  show"
==========================================
BGP troubelshooting commands
==========================================
  imish
  show ip route
  show ip bgp summary
  show ip bgp neighbours
==========================================
troubleshooting LTM commands
==========================================

show ltm virtual "virtual server name" detail

=========================================================
F5 Packet capture
==========================================================
tcpdump -ni 0.0:nnnp host 10.8.12.72 -s0 -vvv -c 10000 -w /var/tmp/cookie_test.pcap 

capture host in a vlan
----------------------
tcpdump -i vlan1388 dst host 10.85.5.10

Disable name resolution
-----------------------
tcpdump -ni vlan1388 dst host 10.85.5.10

tcpdump 'tcp[tcpflags] & (tcp-syn) != 0'
tcpdump 'tcp[tcpflags] & (tcp-rst) != 0'

tcpdump -ni vlan1388 -w proxy_maali_troubleshooting host 10.86.5.10


tcpdump host 10.90.100.1 and port 80
tcpdump src host 172.16.101.20 and dst port 80
tcpdump src host 172.16.101.20 and dst host 10.90.100.1



cd /config/
ls
grep -r 'de.kaw-bs-poci-snat-fe-qa'


==========================================
changing partition LTM commands
==========================================
cd "partition name"





Command line utility
tmsh show /ltm pool <pool_name>
tmsh show /ltm node <node_IP>

bash bigtop -n
bash bigpipe pool show, bigpipe node show



For the CPU utilization (short by average 5 seconds)
You may try this command:

# tmctl -d blade virtual_server_cpu_stat -K avg_5sec -O -L 10

The example output will be similar to:
name                        avg_5sec avg_1min avg_5min slot_id
--------------------------- -------- -------- -------- -------
/Common/TEST_VS1                   0        0        0       0
/Common/TEST_VS2                   0        0        0       0
/Common/REJECT                     0        0        0       0
/Common/TCP                        0        0        0       0
/Common/TEST_IRULE                 0        0        0       0

The -K is sort based on which column and the -L means how many output entries.

This means the TMCTL command is getting the virtual server CPU status, sorting by the avg_5sec column and output top 10 entires.
You may modify the command based on the need, to output more entries.

The output value is not the CPU utilization (%), but a number to refer that which one is taking more CPU resources.
